In [1]:
import numpy as np
import pandas as pd

In [3]:
pd.isnull(np.nan)

True

In [4]:
pd.isnull(None)

True

In [5]:
pd.isna(None)

True

In [6]:
pd.isna(np.nan)

True

In [7]:
pd.notnull(3)

True

In [8]:
pd.notna(None)

False

In [9]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [35]:
df = pd.DataFrame([['2021-03-06 11:18:25.652', 'jan'], ['Sat Mar 06 11:18:25 CST 2021', 'janney']], columns=['TIME', 'SE'])

In [36]:
df

                           TIME      SE
0       2021-03-06 11:18:25.652     jan
1  Sat Mar 06 11:18:25 CST 2021  janney

In [37]:
df['TIME'] = pd.to_datetime(df['TIME'])

D:\ProgramData\Anaconda3\lib\site-packages\dateutil\parser\_parser.py:1213: UnknownTimezoneWarning: tzname CST identified but not understood.  Pass `tzinfos` argument in order to correctly return a timezone-aware datetime.  In a future version, this will raise an exception.
  warnings.warn("tzname {tzname} identified but not understood.  "

In [38]:
df

                     TIME      SE
0 2021-03-06 11:18:25.652     jan
1 2021-03-06 11:18:25.000  janney

In [46]:
s = pd.Series([np.nan, 'a', 1])

In [47]:
s

0    NaN
1      a
2      1
dtype: object

In [43]:
s.isnull()

0     True
1    False
2    False
dtype: bool

In [44]:
s.notnull()

0    False
1     True
2     True
dtype: bool

In [45]:
 s[s.notnull()]

1    a
2    1
dtype: object

In [48]:
s.dropna()

1    a
2    1
dtype: object

In [49]:
s

0    NaN
1      a
2      1
dtype: object

In [51]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5, 8, 34, 110],
})

In [52]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [53]:
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])

In [54]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [58]:
df.dropna(thresh=3, axis='columns')

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

In [56]:
 df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [57]:
df.dropna(how='all')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [59]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [62]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [63]:
s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [64]:
s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [65]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [67]:
df.fillna({'Column A': 0, 'Column B': 99, 'Column C': df['Column C'].mean()})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [68]:
df.fillna(method='ffill', axis=0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [69]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [70]:
df.fillna(method='ffill', axis=1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

In [73]:
s.dropna().count()

4

In [74]:
len(s)

6

In [75]:
s.count()

4

In [76]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [77]:
pd.Series([True, False, False]).any()

True

In [78]:
pd.Series([True, False, True]).all()

False

In [80]:
s.isnull().any()

True